{
  "id": "c1-week-1-speaking",
  "weekId": "week-1",
  "type": "speaking",
  "level": "C1",
  "title": "Academic Discourse & Critical Analysis",
  "description": "Practice sophisticated academic discussion, analyzing complex arguments and presenting nuanced viewpoints.",

  "sentences": [
    {
      "id": "s1",
      "text": "While the study's methodology appears sound, the sample size raises legitimate concerns about the generalizability of its findings.",
      "translation": "연구 방법론은 타당해 보이지만, 표본 크기는 연구 결과의 일반화 가능성에 대한 정당한 우려를 제기한다.",
      "tips": "'While' 양보절로 시작하여 균형 잡힌 비평을 표현하세요."
    },
    {
      "id": "s2",
      "text": "The author's assertion that economic factors supersede cultural influences seems somewhat reductive.",
      "translation": "경제적 요인이 문화적 영향을 능가한다는 저자의 주장은 다소 환원주의적으로 보인다.",
      "tips": "'reductive'는 복잡한 것을 단순화시킨다는 비판적 표현입니다."
    },
    {
      "id": "s3",
      "text": "Had the researchers controlled for confounding variables, the correlation might have proven spurious.",
      "translation": "연구자들이 교란 변수를 통제했다면, 그 상관관계는 허위로 판명되었을 수 있다.",
      "tips": "Inverted conditional (Had + subject)로 가정법을 세련되게 표현하세요."
    },
    {
      "id": "s4",
      "text": "The conclusions are predicated on assumptions that warrant further scrutiny.",
      "translation": "그 결론들은 추가적인 검토가 필요한 가정에 기반하고 있다.",
      "tips": "'predicated on'과 'warrant scrutiny'는 학술적 표현입니다."
    },
    {
      "id": "s5",
      "text": "This paradigm shift could fundamentally alter how we conceptualize cause and effect.",
      "translation": "이 패러다임 전환은 우리가 인과관계를 개념화하는 방식을 근본적으로 바꿀 수 있다.",
      "tips": "'paradigm shift'와 'conceptualize'는 학술 담론의 핵심 표현입니다."
    },
    {
      "id": "s6",
      "text": "One cannot help but question whether the outcomes are attributable to the intervention itself.",
      "translation": "그 결과가 개입 자체에 기인하는지 의문을 제기하지 않을 수 없다.",
      "tips": "'One cannot help but'은 격식체에서 불가피함을 표현합니다."
    },
    {
      "id": "s7",
      "text": "The implications extend far beyond the immediate field, reshaping interdisciplinary discourse.",
      "translation": "그 함의는 해당 분야를 넘어서 학제간 담론을 재형성한다.",
      "tips": "'interdisciplinary discourse'로 광범위한 영향을 표현하세요."
    },
    {
      "id": "s8",
      "text": "Notwithstanding the limitations, the study makes a compelling case for reconsidering established theories.",
      "translation": "한계에도 불구하고, 이 연구는 확립된 이론의 재고를 위한 설득력 있는 주장을 펼친다.",
      "tips": "'Notwithstanding'은 격식체의 'despite'입니다."
    },
    {
      "id": "s9",
      "text": "The data lends credence to the hypothesis, though longitudinal research would be necessary.",
      "translation": "데이터는 그 가설에 신빙성을 더해주지만, 종단적 연구가 필요할 것이다.",
      "tips": "'lends credence to'는 신빙성을 더한다는 학술 표현입니다."
    },
    {
      "id": "s10",
      "text": "It would be premature to draw definitive conclusions from preliminary findings.",
      "translation": "예비 연구 결과로 확정적인 결론을 내리는 것은 시기상조일 것이다.",
      "tips": "'premature'로 과학적 신중함을 표현하세요."
    },
    {
      "id": "s11",
      "text": "The theoretical framework provides a robust foundation for understanding these phenomena.",
      "translation": "그 이론적 틀은 이러한 현상들을 이해하기 위한 견고한 기반을 제공한다.",
      "tips": "'theoretical framework'와 'robust'는 학술 글쓰기 핵심 표현입니다."
    },
    {
      "id": "s12",
      "text": "Insofar as the evidence supports the thesis, we might tentatively accept the proposed model.",
      "translation": "증거가 논제를 뒷받침하는 한, 우리는 제안된 모델을 잠정적으로 받아들일 수 있다.",
      "tips": "'Insofar as'와 'tentatively'로 조건부 수용을 표현하세요."
    }
  ],

  "dialoguePractice": {
    "title": "Academic Conference Discussion",
    "roles": ["Dr. Kim", "Prof. Lee"],
    "lines": [
      {"role": "Dr. Kim", "text": "I found your presentation on cognitive biases quite thought-provoking."},
      {"role": "Prof. Lee", "text": "Thank you. I've been grappling with how to reconcile the data with behavioral observations."},
      {"role": "Dr. Kim", "text": "Your model seems to presuppose a degree of rationality the evidence doesn't fully support."},
      {"role": "Prof. Lee", "text": "A fair point. However, what appears irrational individually may serve evolutionary purposes collectively."},
      {"role": "Dr. Kim", "text": "Intriguing. Have you considered how this intersects with game theory?"},
      {"role": "Prof. Lee", "text": "Indeed. I've been collaborating with economists to explore those connections."},
      {"role": "Dr. Kim", "text": "I'd be interested to see that research. It could bridge significant gaps in the literature."},
      {"role": "Prof. Lee", "text": "Perhaps we could discuss potential collaboration? Your methodology expertise would be invaluable."}
    ]
  },

  "evaluationChecklist": [
    {
      "category": "Academic Register",
      "items": [
        "Did you use appropriate academic vocabulary?",
        "Did you hedge claims appropriately?",
        "Did you maintain formal register throughout?",
        "Did you use sophisticated connectors?"
      ]
    },
    {
      "category": "Argumentation",
      "items": [
        "Did you present balanced critiques?",
        "Did you acknowledge counterarguments?",
        "Did you support claims with reasoning?",
        "Did you draw nuanced conclusions?"
      ]
    },
    {
      "category": "Fluency & Coherence",
      "items": [
        "Did you maintain natural flow in complex sentences?",
        "Did you use appropriate discourse markers?",
        "Did you develop arguments coherently?"
      ]
    },
    {
      "category": "Advanced Grammar",
      "items": [
        "Did you use inverted conditionals correctly?",
        "Did you employ complex noun phrases?",
        "Did you maintain subject-verb agreement?"
      ]
    }
  ]
}
